docs: update wso2-am-gateway README.md
